[
    {
        "source": "reddit",
        "url": "https://www.reddit.com/r/investing/comments/cs259b/climate_change_investing_idea/",
        "title": "Climate change investing idea",
        "description": "Have been reading about how a lot of cities/countries are building seawalls around places like Manhattan, Venice, as well as the Netherlands to combat rising water levels.  I think this could be a good macro trend to ride but I’m not aware of any public companies that exist for this so I was wondering if there were any good ways to play this or if this is going to be more of a VC/PE play at this point that would be out of reach to a retail investor?  Economist article on the subject: Climate change is a remorseless threat to the world’s coasts from The Economist https://www.economist.com/briefing/2019/08/17/climate-change-is-a-remorseless-threat-to-the-worlds-coasts",
        "date": "17 minutes ago"
    },
    {
        "source": "reddit",
        "url": "https://www.reddit.com/r/investing/comments/cs1eq5/25_free_bitcoin_no_purchase_required_usa_only/",
        "title": "$25 Free Bitcoin! No Purchase Required (U.S.A Only)",
        "description": "https://youtu.be/ICL28qm2634",
        "date": "1 hour ago"
    },
    {
        "source": "reddit",
        "url": "https://www.reddit.com/r/investing/comments/cs1pnd/thoughts_on_mylo_investing_app/",
        "title": "Thoughts on Mylo investing app",
        "description": "Anybody here use Mylo? What’s your thoughts and opinions ! Good and bad I’d love to hear it all.",
        "date": "54 minutes ago"
    },
    {
        "source": "reddit",
        "url": "https://www.reddit.com/r/investing/comments/cs1cqn/20_yo_clueless_what_to_do/",
        "title": "20 yo clueless what to do",
        "description": "As title says I’m 20 and I have no idea what to do with investing. I know I want to invest however I’m not sure how to.  I have about 2k to initially put into it then about £300-£400 a month to add for a little while st least while I have minimal bills.  Should I learn about investing and invest myself or should I just put the money into a robo advisor?",
        "date": "1 hour ago"
    },
    {
        "source": "reddit",
        "url": "https://www.reddit.com/r/investing/comments/crxgal/warren_buffett_comments_on_ges_accounting_and/",
        "title": "Warren Buffett comments on GE's accounting and debt, and explains why Berkshire Hathaway sold all its GE stock",
        "description": "YouTube video of Buffett talking about GE's problems:  https://youtu.be/TM9ztFadLLs?t=4m10s  The Markopolos report is essentially quantifying these problems and showing that they are far more serious than previously believed  Read the report here:  http://fm.cnbc.com/applications/cnbc.com/resources/editorialfiles/2019/8/15/2019_08_15_GE_Whistleblower_Report.pdf  Be careful, everyone",
        "date": "9 hours ago"
    },
    {
        "source": "reddit",
        "url": "https://www.reddit.com/r/investing/comments/crtutr/i_found_the_most_insane_shit_while_thrifting_today/",
        "title": "I found the most insane shit while thrifting today",
        "description": "My wife is a big thrifter, so of course I have to tag along. While looking around, I found the most batshit crazy stuff in the World: The Gann System. More specifically, a CD-Rom for the \"Natural Squares Calculator.\" I'm a pretty big Finance Nerd, and I enjoy debunking Woo, so of course I bought it. This was NOT covered in college, and after watching one of the videos, I know why. This basically astrology. According to Wiki, this Gann guy actually used Astrology in conjunction with Bible Codes to make it. They made of their own little Compass device to read the market and everything.  Has anyone heard of this stuff?",
        "date": "15 hours ago"
    },
    {
        "source": "reddit",
        "url": "https://www.reddit.com/r/investing/comments/crzvim/what_do_etf_providers_do_with_dividend_money/",
        "title": "What do ETF providers do with dividend money between payouts?",
        "description": "So, most ETFs (at least stock ETFs) pay dividends quarterly. But in between payouts, they accumulate cash from stocks that pay monthly and any stocks whose timing doesn't match with the ETF (like, almost all of them). What do they do with that cash?  I'm assuming that they put it in a money market fund -- am I correct? If so, is the earned interest passed on to the ETF holder?",
        "date": "4 hours ago"
    },
    {
        "source": "reddit",
        "url": "https://www.reddit.com/r/investing/comments/crymjv/why_do_people_sometimes_dismiss_valid_information/",
        "title": "Why do people sometimes dismiss valid information when it comes to investing, even though it seems empirically valid?",
        "description": "Ok, not gonna lie here, the guys at /r/wallstreetbets are mostly clowns. But, that being said, during this week's volatility they had a better idea of the reasons the market was going up or down than most people here or on other subreddits.  Nobody is saying to use them as a guide for investing in the market, but wtf, at least they are starting to understand aspects of the market better than most geniuses who love Buffet and try to get rich after 60 years of investing...  Discuss",
        "date": "6 hours ago"
    }
]